[
  {
    "id": 448393021,
    "title": "215 Cumming St",
    "location": "Thunder Bay, ON",
    "price": "$264900 CAD/year",
    "rating": 5.0,
    "type": "Single_family",
    "image": "https://photos.zillowstatic.com/fp/d935710e37546a9b3c50d43f51b7dc63-p_h.jpg",
    "description": "Fully Renovated! Great Location! Ideal for First-time Home Buyers or Savvy Investor! This beautifully renovated 3 Bedroom 2 Bathroom Single Family Home features hardwood flooring up and down,  Main Floor Office/Den, spacious Chef's Kitchen with huge Eating Area, Main Floor full bathroom with Heated Floors and Steam Shower. Upstairs features a huge Master Bedroom with additional Closet/Storage, 2 additional large secondary bedrooms and a Full Bathroom with heated floors and a magnificent free-standing tub. The huge basement is partially finished, full height with a separate pantry and laundry area. Overlooking the street is a large functional enclosed front porch for loads of additional storage. Situated on a huge lot with back lane access and gated parking. Close to all the amenities that Fort William has to offer. New Furnace 2016, A/C 2022, Front porch Roof 2015, Rear Roof over Kitchen 2024, Sump Pump, Backflow Valve and sewer line relined in 2024. A must see, this one won't last long. Book your appointment through ShowingTime or call Listing Agent at 613-889-2865",
    "features": [
      {
        "icon": "bed-outline",
        "label": "3 Bedroom"
      },
      {
        "icon": "water-outline",
        "label": "2 Bathroom"
      },
      {
        "icon": "resize-outline",
        "label": "None sqft"
      }
    ],
    "agent": {
      "name": "SOLID ROCK REALTY",
      "image": "https://i.pravatar.cc/100?u=448393021"
    }
  },
  {
    "id": 2057167284,
    "title": "416 2nd Ave E",
    "location": "Thunder Bay, ON",
    "price": "$249800 CAD/year",
    "rating": 5.0,
    "type": "Lot",
    "image": "https://photos.zillowstatic.com/fp/f76a327253965795c5949af127be152d-p_h.jpg",
    "description": "Located in the heart of Thunder Bay, Ontario, this piece of land measures 75 feet in width and 140 feet in length. With draft plan approval already in place, it offers an excellent opportunity for development. The lot is zoned to accommodate a quad unit, making it ideal for rental purposes. Each unit within the quad is designed with four spacious bedrooms, providing ample living space for residents. The layout includes a well-appointed kitchen and two bathrooms, ensuring convenience and comfort. The units are thoughtfully designed to optimize natural light and provide a comfortable living environment. Additionally, the property offers outdoor parking, allowing residents and visitors to park their vehicles conveniently on-site. This feature enhances accessibility and convenience for the occupants of the quad unit. With its prime location in Thunder Bay's central area, the land benefits from proximity to various amenities, including LakeHead University Confederation College & hospitals **EXTRAS** The vibrant community offers a diverse range of services and entertainment options, creating a desirable living environment for future residents.",
    "features": [
      {
        "icon": "bed-outline",
        "label": "15 Bedroom"
      },
      {
        "icon": "water-outline",
        "label": "9 Bathroom"
      },
      {
        "icon": "resize-outline",
        "label": "None sqft"
      }
    ],
    "agent": {
      "name": "ROYAL LEPAGE CITIZEN REALTY",
      "image": "https://i.pravatar.cc/100?u=2057167284"
    }
  },
  {
    "id": 2055716067,
    "title": "2528 Dawson Rd",
    "location": "Thunder Bay, ON",
    "price": "$769900 CAD/year",
    "rating": 5.0,
    "type": "Single_family",
    "image": "https://photos.zillowstatic.com/fp/dd6bdddc9f4e1d1f9e86fcbdc3edea1f-p_h.jpg",
    "description": "COUNTRY LIIVNG AT ITS BEST IN THE CITY. BEAUTIFUL BUNGALOW WITH FINISHED BASEMENT APARTMENT SITTING ON OVER 25 ACRES OF LAND, LOCATED ON A MAIN ROAD. SURROUNDED BY MATURE TREES AND RIVER RUNNING NEAR BY. FUTURE DEVELOPMENT POTENTIAL. IDEAL FOR HUNTING, CAMPING, STORAGE & PARKING. LARGE 32 FEET X 32 FEET MECHANIC WORKSHOP/GARAGE WITH 12 FOOT CEILINGS, 2 PORTABLE GARAGES. FENCED IN CHICKEN COOP. 20 FEET X 25 FEET GARAGE. WALKOUT DECK FROM THE KITCHEN OVERLOOKING PROPERTY. COME ENJOY THIS BEAUTIFUL ESCAPE FROM THE CITY LIFE. **EXTRAS** NEW WELL PUMP. ROOF DONE 2015. HOT WATER TANK 2 YEARS OLD. FURNACE OWNED. WINDOWS 2 YEARS OLD.",
    "features": [
      {
        "icon": "bed-outline",
        "label": "5 Bedroom"
      },
      {
        "icon": "water-outline",
        "label": "2 Bathroom"
      },
      {
        "icon": "resize-outline",
        "label": "None sqft"
      }
    ],
    "agent": {
      "name": "CHAMPS REAL ESTATE BROKERAGE INC.",
      "image": "https://i.pravatar.cc/100?u=2055716067"
    }
  }
]